<!-- dflook/terraform-github-actions {"workspace":"verify-opentofu-2","backend_type":"remote","backend":"0644ae8056818e88b27f5b4642cc0a05d1d0e1292a1700ec522ea245ba91a513","plan_job_ref":"Job Test Terraform cloud #224 at https://github.com/dflook/terraform-github-actions/actions/runs/7503550469","plan_hash":"8f87e212cb68be29dba2827f7aeb6d58aa3553a92fb62da2106984e2f32b1d55","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/0.13__ in the __verify-opentofu-2__ workspace
With var files: `tests/workflows/test-cloud/0.13/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test Terraform cloud #224](https://github.com/dflook/terraform-github-actions/actions/runs/7503550469)